# Homework 4 - pandas (Masoud A. Rostami)  
### due 3/1/2022   

Use this notebook and prompts to complete the homework. Throughout there will be hints and some code provided  

### Things you will need:  
- Install os, NumPy, pandas  
- states_covid.csv  
- Bloom_etal_2018_Reduced_Dataset.csv  
- logfiles.tgz (or some other multiple file dataset)  

*NOTE*: Make sure your PATH is correct  

**import packages & check required datasets**

In [222]:
import os
import numpy as np
import pandas as pd

In [299]:
os.getcwd()

'/Users/masoud/Downloads/Data_Science_For_Biology_II-Spring_22/Part.3.PythonProgramming/Pandas'

In [10]:
PATH = '/Users/masoud/Downloads/Data_Science_For_Biology_II-Spring_22/Part.3.PythonProgramming/Pandas' #CHANGE

In [11]:
assert os.path.exists(os.path.join(PATH,'states_covid.csv')), 'states_covid.csv does not exist'

In [12]:
assert os.path.exists(os.path.join(PATH,'Bloom_etal_2018_Reduced_Dataset.csv')), 'Bloom_etal_2018_Reduced_Dataset.csv does not exist'

## Task 1 - DataFrame manipulation  

Using **states_covid.csv**, we are going to read the data in as a DataFrame to manipulate, subset, and filter in various ways.   

### Task 1.1 

Read in states_covid.csv with date as a "date" dtype, and only columns consisting of the hospitalization (4 col), ICU (2 col), and Ventilators (2 col)

In [204]:
covid_df=pd.read_csv('states_covid.csv')

In [205]:
covid_df.columns

Index(['date', 'state', 'death', 'deathConfirmed', 'deathIncrease',
       'deathProbable', 'hospitalized', 'hospitalizedCumulative',
       'hospitalizedCurrently', 'hospitalizedIncrease', 'inIcuCumulative',
       'inIcuCurrently', 'negative', 'negativeIncrease',
       'negativeTestsAntibody', 'negativeTestsPeopleAntibody',
       'negativeTestsViral', 'onVentilatorCumulative', 'onVentilatorCurrently',
       'positive', 'positiveCasesViral', 'positiveIncrease', 'positiveScore',
       'positiveTestsAntibody', 'positiveTestsAntigen',
       'positiveTestsPeopleAntibody', 'positiveTestsPeopleAntigen',
       'positiveTestsViral', 'recovered', 'totalTestEncountersViral',
       'totalTestEncountersViralIncrease', 'totalTestResults',
       'totalTestResultsIncrease', 'totalTestsAntibody', 'totalTestsAntigen',
       'totalTestsPeopleAntibody', 'totalTestsPeopleAntigen',
       'totalTestsPeopleViral', 'totalTestsPeopleViralIncrease',
       'totalTestsViral', 'totalTestsViralIncrease'],
      dtype='object')

In [ ]:
# select the variable we want

In [223]:
covid_df=pd.read_csv('states_covid.csv', usecols=['date','state','hospitalized', 'hospitalizedCumulative',
       'hospitalizedCurrently', 'hospitalizedIncrease','inIcuCumulative', 'inIcuCurrently', 'onVentilatorCumulative', 'onVentilatorCurrently'], parse_dates=['date'])

### Task 1.2 

For each of the following catergories: *currently* hospitalized, *currently* in the ICU, and *currently* on ventilation...  
Find the 5 states with the greatest numbers in each catergory and list them in order.      
*hint*: sort_values, unique

In [229]:
covid_df1=covid_df[['state','hospitalizedCurrently','inIcuCurrently','onVentilatorCurrently']]

In [231]:
covid_df1=covid_df1.dropna(axis=0) # remove the missing values

In [232]:
covid_df1.head() # top rows in a table

   state  hospitalizedCurrently  inIcuCurrently  onVentilatorCurrently
2     AR                  545.0           204.0                   99.0
4     AZ                 1515.0           447.0                  266.0
8     DC                  211.0            57.0                   31.0
12    GU                    4.0             2.0                    2.0
13    HI                   37.0             7.0                    6.0

In [233]:
covid_df1.hospitalizedCurrently.unique() # unique values

array([ 545., 1515.,  211., ..., 7363., 7026., 7017.])

In [ ]:
# Answering the question

In [273]:
states=covid_df1.groupby(["state"]).mean() # group your counties by state, get means

In [ ]:
# top 5 states rgarding hospitalizedCurrently

In [277]:
states_sorted = states.sort_values(by="hospitalizedCurrently", ascending=False).reset_index().copy() ## sorted by hospitalizedCurrently
states_sorted.head()

  state   index  hospitalizedCurrently  inIcuCurrently  onVentilatorCurrently
0    PA  3177.0            4106.035398      840.504425             477.884956
1    NY  8213.0            3244.351536      691.883959             449.324232
2    IL  9032.0            2965.941176      687.046440             368.229102
3    NJ  9050.0            2341.164087      530.012384             368.244582
4    MO  3554.0            2195.661417      520.818898             281.960630

In [ ]:
# top 5 states rgarding inIcuCurrently

In [278]:
states_sorted = states.sort_values(by="inIcuCurrently", ascending=False).reset_index().copy() # sorted by inIcuCurrently
states_sorted.head() # show top 5 rows

  state   index  hospitalizedCurrently  inIcuCurrently  onVentilatorCurrently
0    PA  3177.0            4106.035398      840.504425             477.884956
1    NY  8213.0            3244.351536      691.883959             449.324232
2    IL  9032.0            2965.941176      687.046440             368.229102
3    AZ  8852.0            1976.097792      531.091483             346.712934
4    NJ  9050.0            2341.164087      530.012384             368.244582

In [ ]:
# top 5 states rgarding onVentilatorCurrently

In [279]:
states_sorted = states.sort_values(by="onVentilatorCurrently", ascending=False).reset_index().copy() # onVentilatorCurrently
states_sorted.head()

  state    index  hospitalizedCurrently  inIcuCurrently  onVentilatorCurrently
0    PA   3177.0            4106.035398      840.504425             477.884956
1    NY   8213.0            3244.351536      691.883959             449.324232
2    NJ   9050.0            2341.164087      530.012384             368.244582
3    IL   9032.0            2965.941176      687.046440             368.229102
4    WI  17525.0             361.000000      141.000000             348.000000

### Task 1.3 

Find the date in which each state crossed 1000 cumulative hospitilized covid patients

In [131]:
covid_df.head(3)

,date,state,hospitalized,hospitalizedCumulative,hospitalizedCurrently,hospitalizedIncrease,inIcuCumulative,inIcuCurrently,onVentilatorCumulative,onVentilatorCurrently
0,2021-02-23,AK,1260.0,1260.0,38.0,9,NaN,NaN,NaN,5.0
1,2021-02-23,AL,45250.0,45250.0,762.0,122,2632.0,NaN,1497.0,NaN
2,2021-02-23,AR,14617.0,14617.0,545.0,47,NaN,204.0,1505.0,99.0

In [137]:
covid_df2=covid_df[['date', 'state', 'hospitalizedCumulative']]

In [135]:
covid_df2[covid_df2.hospitalizedCumulative>1000]

            date state  hospitalizedCumulative
0     2021-02-23    AK                  1260.0
1     2021-02-23    AL                 45250.0
2     2021-02-23    AR                 14617.0
4     2021-02-23    AZ                 57072.0
6     2021-02-23    CO                 23293.0
...          ...   ...                     ...
18797 2020-03-25    NY                  5126.0
18853 2020-03-24    NY                  4041.0
18909 2020-03-23    NY                  3125.0
18965 2020-03-22    NY                  2354.0
19021 2020-03-21    NY                  1531.0

[9303 rows x 3 columns]

## Task 2 - DataFrame summarizing  

Using **Bloom_etal_2018_Reduced_Dataset.csv**, we are going to do more dataframe manipulation and subsetting and summarizing    

### Task 2.1 

Read in Bloom_etal_2018_Reduced_Dataset.csv and create two new columns ('genus','species') that consists of the column *taxa* split at the underscore. Print out the head of this new dataframe and the number of unique genera**     

*hint:* pd.str.split(,expand=True)  

for example:  

| taxa | genus | species   
| :------ | :-- | :---   
| Alosa_alabamae | Alosa | alabamae

In [138]:
Bloom=pd.read_csv('Bloom_etal_2018_Reduced_Dataset.csv')

In [139]:
Bloom.head(3)

             taxa  logbodysize  trophic_position         Reg
0  Alosa_alabamae     1.707570          0.431364  diadromous
1     Alosa_alosa     1.778151          0.556303  diadromous
2    Alosa_fallax     1.778151          0.556303  diadromous

In [145]:
Bloom2=Bloom["taxa"].str.split('_', expand=True, n=1)

In [148]:
Bloom2.head(3)

       0         1
0  Alosa  alabamae
1  Alosa     alosa
2  Alosa    fallax

In [286]:
Bloom2.rename({0: 'Genus', 1: 'Species'}, axis=1, inplace=True)

In [287]:
Bloom2

             Genus         Species
0            Alosa        alabamae
1            Alosa           alosa
2            Alosa          fallax
3            Alosa       mediocris
4            Alosa  pseudoharengus
5            Alosa     sapidissima
6   Amazonsprattus       scintilla
7           Anchoa       chamensis
8           Anchoa          cubana
9           Anchoa   delicatissima
10          Anchoa    lamprotaenia
11          Anchoa        lyolepis
12          Anchoa           parva
13          Anchoa      schofieldi
14        Anchovia    surinamensis
15     Anchoviella         balboae
16     Anchoviella    brevirostris
17     Anchoviella          jamesi
18     Anchoviella  lepidentostole
19     Anchoviella      manamensis
20   Anodontostoma        chacunda
21    Cetengraulis       edentulus
22  Chirocentrodon    bleekerianus
23    Clupeichthys      perakensis
24      Clupeoides      borneensis
25          Coilia           nasus
26         Ehirava     fluviatilis
27  Encrasicholina          devisi
28       Engraulis       eurystole
29       Escualosa       thoracata
30       Ethmalosa       fimbriata
31   Gilchristella       aestuaria
32           Hilsa           kelee
33     Hyperlophus        vittatus
34       Jenkinsia    lamprotaenia
35    Microthrissa         congica
36         Pellona       harroweri
37       Pellonula       leonensis
38       Pellonula           vorax
39      Potamalosa      richmondia
40     Ramnogaster              sp
41   Rhinosardinia       bahiensis
42      Sauvagella         robusta
43   Sierrathrissa       leonensis
44   Spratelloides     delicatulus
45     Stolephorus          waitei
46    Stolothrissa      tanganicae
47     Sundasalanx     mekongensis
48       Tenualosa          ilisha
49         Thryssa   cf_dussumieri

### Task 2.2 

Create a new dataframe with the mean *logbodysize* and *trophicposition* of each genera. Sort this data frame by the largest body size. Print the head of this dataframe.

In [290]:
Bloom=pd.read_csv('Bloom_etal_2018_Reduced_Dataset.csv') # import the datasets

In [291]:
Bloom.head(3) # top three rowa

             taxa  logbodysize  trophic_position         Reg
0  Alosa_alabamae     1.707570          0.431364  diadromous
1     Alosa_alosa     1.778151          0.556303  diadromous
2    Alosa_fallax     1.778151          0.556303  diadromous

In [292]:
Bloom_mean=Bloom.groupby('taxa',as_index=True).agg(['mean']) # group by taxa and extract the means

In [293]:
Bloom_mean.head(3)

               logbodysize trophic_position
                      mean             mean
taxa
Alosa_alabamae    1.707570         0.431364
Alosa_alosa       1.778151         0.556303
Alosa_fallax      1.778151         0.556303

In [294]:
Bloom_mean.columns

MultiIndex([(     'logbodysize', 'mean'),
            ('trophic_position', 'mean')],
           )

In [296]:
Bloom_mean.columns = Bloom_mean.columns.map(''.join)
Bloom_mean.head()

                      logbodysizemean  trophic_positionmean
taxa
Alosa_alabamae               1.707570              0.431364
Alosa_alosa                  1.778151              0.556303
Alosa_fallax                 1.778151              0.556303
Alosa_mediocris              1.778151              0.612784
Alosa_pseudoharengus         1.602060              0.544068

In [297]:
Bloom_mean.columns

Index(['logbodysizemean', 'trophic_positionmean'], dtype='object')

In [298]:
Bloom_mean.sort_values('logbodysizemean',ascending=False,inplace=True) # sort value for logbodysizemean
Bloom_mean.head()

                   logbodysizemean  trophic_positionmean
taxa
Alosa_sapidissima         1.790285              0.544068
Alosa_alosa               1.778151              0.556303
Alosa_fallax              1.778151              0.556303
Alosa_mediocris           1.778151              0.612784
Tenualosa_ilisha          1.778151              0.462398

In [198]:
Bloom_mean.sort_values('trophic_positionmean',ascending=True,inplace=True)# sort value for 'trophic_positionmean'
Bloom_mean.head()

                         logbodysizemean  trophic_positionmean
taxa
Cetengraulis_edentulus          1.113943              0.322219
Ethmalosa_fimbriata             1.544068              0.397940
Stolothrissa_tanganicae         1.000000              0.431364
Alosa_alabamae                  1.707570              0.431364
Anodontostoma_chacunda          1.342423              0.447158

Which genera is the smallest and largest?

In [ ]:
# Alosa_sapidissima has the largest body size, and Amazonsprattus_scintilla smallest  body size

What is the trophic position of the smallest and largest?

In [ ]:
# Pellona_harroweri ahs highest  tropich position, Cetengraulis_edentulus lowest tropich position

## Task 3 - Read in muliple files to a dictionary and make a DataFrame - **OPTIONAL/BONUS**  

### This is not something you are expected to do in this course, but just here to give you an idea of the things that you COULD do. Answers will be posted after due date.  


Using **logfiles**: we are going to do read in each file, get some data, append it to a dictionary to later make into a dataframe.     

**note:** *make sure to unzip logfiles*

In [20]:
cd $PATH

/Users/trevorfaske/Desktop/Classes/DataScience/pandas/Spring22

In [21]:
!tar -xzf logfiles.tgz #unzip logfiles

In [22]:
log_dir = os.path.join(PATH,'logfiles')
assert os.path.exists(log_dir), 'log_dir does not exist'

First step is to find the necessary files. The number of files in the log files is 36, make sure you have that many as well

In [23]:
!ls -l logfiles/*txt | wc -l

      36

In [24]:
logfiles = !find $log_dir -name '*txt' #unix command to find files in log_dir directory
logfiles = [os.path.abspath(x) for x in logfiles] #this finds the full path to the file
print(logfiles[1])

/Users/trevorfaske/g/Classes/DataScience/pandas/Spring22/logfiles/1901302121_H8_S_14.txt.txt

In [25]:
assert(len(logfiles)==36), 'Do not have correct number of logfiles'

### Getting a little tricky here  

Read in each of the logfiles, for each file extract:  
- minimum temperature  
- maximum temperature  
- date of minimum temp   
- date of maximum temp   
- mean temp for each file.   

This data should all be appended for a dictionary within a for loop:    
Key should be the file name without the path or .txt extension  
Values should be (minTemp,maxTemp,minDate,maxDate,meanTemp)

I recommend making this work for one file first, then putting the rest in a for loop to do the rest.  

Below is an example of how to read in one file

*hint:* do not read date in as date object

In [41]:
### set up data frame as you read in each file
infile = pd.read_csv(logfiles[0],sep='\t',engine='python')
infile.columns = ['Index','Date','Time','Temp','Type']
infile = infile[['Date','Time','Temp']]
infile.head()

        Date         Time  Temp
0  9/16/2013   8:00:00 AM  47.9
1  9/16/2013   8:35:00 AM  48.2
2  9/16/2013   9:10:00 AM  48.7
3  9/16/2013   9:45:00 AM  49.4
4  9/16/2013  10:20:00 AM  50.3

Do everything in steps, make sure it works. Calculate summaries with this one infile:

In [26]:
minTemp =   
maxTemp =  
minDate = infile['Date'][infile['Temp'] == infile['Temp'].min()].unique()[0] #use this for minDate 
maxDate = infile['Date'][infile['Temp'] == infile['Temp'].max()].unique()[0] #use this for maxDate 
meanTemp =

SyntaxError: invalid syntax (<ipython-input-26-d888355c2242>, line 1)

To get you started, I suggest writing some dummy code in plain words to help outline your for loop:

In [ ]:
logfiles_dict = {}  
for f in logfiles:  
    #do something   
    #do not read date in as date object  
    #do more something   
    #do other stuff  
    #make print statements EVERYWHERE  
    #append to dict  
    #blahbahblah

Then do the real code below here. You don't need to turnin your thoughts. Just put it in there as a help reminder. Most people all still do this, no matter how advanced they are

**Once you have created a DataFrame with all the logfiles, print the head and save it to an outfile using pd.to_csv() as logfiles_df.csv**

#### Here is an example of the final product

In [32]:
logfiles_df.head()

                     minTemp  maxTemp     minDate    maxDate   meanTemp
1901302235_H6_S_14      21.3     65.8   12/6/2013  7/13/2014  35.726191
1901302121_H8_S_14      17.9     73.4  10/28/2013  7/13/2014  34.698866
1901302217_H18_D_14     21.0     82.4  10/28/2013  7/26/2014  33.334564
1901302110_H13_S_14     22.8     60.9   10/4/2013  7/13/2014  32.240032
1901302146_H14_D_14     24.6     66.1   1/21/2014  7/13/2014  34.242075